Revit 2027 API
RebarFreeFormAccessor.GetComputationDataFor3DPathSet Method
 For a free form set distributed along a 3D path, this method gets the computation data.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ComputationDataFor3DPathSet GetComputationDataFor3DPathSet()
Public Function GetComputationDataFor3DPathSet As ComputationDataFor3DPathSet
public:
ComputationDataFor3DPathSet^ GetComputationDataFor3DPathSet()
member GetComputationDataFor3DPathSet : unit -> ComputationDataFor3DPathSet
Return Value
ComputationDataFor3DPathSet
 Returns the computation data.
Exceptions
Exception | Condition
InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar is not created with the 3D Path Free Form rebar server.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace